titanic数据集由三张表组成，存放在dataset数据库/模式中：

titanic_gender_submission(PassengerId, Survived)

titanic_test(PassengerId, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin,Embarked)

titanic_train(PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked)


titanic_gender_submission表示提交文件，各属性依次为乘客编号、是否存活。

titanic_test表示测试集，各属性依次为乘客编号、船舱等级、姓名、性别、年龄、兄弟姐妹和配偶数量、父母与子女数量、车票编号、票价、座位号、码头。

titanic_train表示训练集，各属性依次为乘客编号、是否存活、船舱等级、姓名、性别、年龄、兄弟姐妹和配偶数量、父母与子女数量、车票编号、票价、座位号、码头。

In [1]:
mysql://stu2101213030:stu2101213030@162.105.88.171:43306

In [2]:
show databases;

,Database
0,dataset
1,information_schema
2,stu2101213030

In [3]:
use dataset;

In [4]:
show tables;

,Tables_in_dataset
0,SurnameOrigin
1,stock
2,titanic_gender_submission
3,titanic_test
4,titanic_train

In [5]:
select * from titanic_test limit 10;

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,0,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,0,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,0,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,0,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,0,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,0,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,0,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,0,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,0,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,0,S